; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v3 - type_2 ?v4 - type_3)
 	      (pred_4 ?v8 - object ?v4 - type_3)
	      (pred_3 ?v3 - type_2 ?v2 - type_1)
	      (pred_2 ?v3 - type_2 ?v8 - object ?v2 - type_1))

   (:action op_3
       :parameters  (?v3 - type_2 ?v7 ?v5 - type_3)
       :precondition (and  (pred_1 ?v3 ?v7))
       :effect (and  (pred_1 ?v3 ?v5)
		     (not (pred_1 ?v3 ?v7))))

   (:action op_2
       :parameters (?v3 - type_2 ?v1 - object ?v6 - type_3 ?v2 - type_1)
       :precondition  (and  (pred_4 ?v1 ?v6) (pred_1 ?v3 ?v6) (pred_3 ?v3 ?v2))
       :effect (and (pred_2 ?v3 ?v1 ?v2)
		    (not (pred_4 ?v1 ?v6)) 
		    (not (pred_3 ?v3 ?v2))))

   (:action op_1
       :parameters (?v3 - type_2 ?v1 - object ?v6 - type_3 ?v2 - type_1)
       :precondition  (and  (pred_2 ?v3 ?v1 ?v2) (pred_1 ?v3 ?v6))
       :effect (and (pred_4 ?v1 ?v6)
		    (pred_3 ?v3 ?v2)
		    (not (pred_2 ?v3 ?v1 ?v2)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_04 - type_2
obj_06 obj_05 - type_1
obj_07 obj_01 obj_02 - type_3
obj_09 obj_08 obj_03 - object)
(:init
(pred_1 obj_04 obj_07)
(pred_3 obj_04 obj_06)
(pred_3 obj_04 obj_05)
(pred_4 obj_09 obj_02)
(pred_4 obj_08 obj_07)
(pred_4 obj_03 obj_01)
)
(:goal
(and
(pred_4 obj_09 obj_01)
(pred_4 obj_08 obj_01)
(pred_4 obj_03 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_04 ?b obj_05))))
)
)

; plan
1. (op_2 obj_04 obj_08 obj_07 obj_06)
   deleted: (pred_4 obj_08 obj_07) (pred_3 obj_04 obj_06)
   added: (pred_2 obj_04 obj_08 obj_06)
   goals met: 0 of 3
2. (op_3 obj_04 obj_07 obj_01)
   deleted: (pred_1 obj_04 obj_07)
   added: (pred_1 obj_04 obj_01)
   goals met: 0 of 3
3. (op_1 obj_04 obj_08 obj_01 obj_06)
   deleted: (pred_2 obj_04 obj_08 obj_06)
   added: (pred_4 obj_08 obj_01) (pred_3 obj_04 obj_06)
   goals met: 1 of 3
4. (op_2 obj_04 obj_03 obj_01 obj_06)
   deleted: (pred_4 obj_03 obj_01) (pred_3 obj_04 obj_06)
   added: (pred_2 obj_04 obj_03 obj_06)
   goals met: 1 of 3
5. (op_3 obj_04 obj_01 obj_07)
   deleted: (pred_1 obj_04 obj_01)
   added: (pred_1 obj_04 obj_07)
   goals met: 1 of 3
6. (op_1 obj_04 obj_03 obj_07 obj_06)
   deleted: (pred_2 obj_04 obj_03 obj_06)
   added: (pred_4 obj_03 obj_07) (pred_3 obj_04 obj_06)
   goals met: 2 of 3
7. (op_3 obj_04 obj_07 obj_02)
   deleted: (pred_1 obj_04 obj_07)
   added: (pred_1 obj_04 obj_02)
   goals met: 2 of 3
8. (op_2 obj_04 obj_09 obj_02 obj_06)
   deleted: (pred_4 obj_09 obj_02) (pred_3 obj_04 obj_06)
   added: (pred_2 obj_04 obj_09 obj_06)
   goals met: 2 of 3
9. (op_3 obj_04 obj_02 obj_01)
   deleted: (pred_1 obj_04 obj_02)
   added: (pred_1 obj_04 obj_01)
   goals met: 2 of 3
10. (op_1 obj_04 obj_09 obj_01 obj_06)
   deleted: (pred_2 obj_04 obj_09 obj_06)
   added: (pred_4 obj_09 obj_01) (pred_3 obj_04 obj_06)
   goals met: 3 of 3
